cf_billing/InformationRegisters/бестДатыПоверкиПрибораУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестДатыПоверкиПрибораУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестДатыПоверкиПрибораУчетаНП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает текст запроса даты поверок действующих приборов учета.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаДатыПоверокДействующихПриборовУчета() Экспорт
	
	Текст  =
		"ВЫБРАТЬ
		|	бестДатыПоверкиПрибораУчетаНПСрезПоследних.Организация КАК Организация,
		|	бестДатыПоверкиПрибораУчетаНПСрезПоследних.Район КАК Район,
		|	бестДатыПоверкиПрибораУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	бестДатыПоверкиПрибораУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
		|	бестДатыПоверкиПрибораУчетаНПСрезПоследних.ДатаПоверки КАК ДатаПоверки
		|ПОМЕСТИТЬ ДатыПоверокДействующихПриборовУчета
		|ИЗ
		|	РегистрСведений.бестДатыПоверкиПрибораУчетаНП.СрезПоследних(
		|			&Период,
		|			(Организация, Район, ТочкаУчета, ПриборУчета) В
		|				(ВЫБРАТЬ
		|					ДействующиеПриборыУчетаПомещения.Организация,
		|					ДействующиеПриборыУчетаПомещения.Район,
		|					ДействующиеПриборыУчетаПомещения.ТочкаУчета,
		|					ДействующиеПриборыУчетаПомещения.ПриборУчета
		|				ИЗ
		|					ДействующиеПриборыУчетаПомещения КАК ДействующиеПриборыУчетаПомещения)) КАК бестДатыПоверкиПрибораУчетаНПСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
